app/views/users/show.html.erb

  	var	add = [];
  	add.push("<%=  user.address %>");
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", ""], ["updated_at", "2015-07-27 17:41:39.401813"], ["id", 1]]